Documents/упДокументТранспортногоСредстваВодителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упДокументТранспортногоСредстваВодителя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упДействующиеДокументыТСВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПропускаНаВъездВыездВЗону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПропусковНаПроездЧерезЗону</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упДокументТранспортногоСредстваВодителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченноеЧислоВодителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченноеЧислоТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Водители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упКатегорииВодительскогоУдостоверения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/упПредупрежденияИОповещения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Создание предупреждение по документам с истекающим сроком действия.
//
Процедура ФормированиеПредупреждений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упДокументТранспортногоСредстваВодителя.Ссылка
	|ПОМЕСТИТЬ втЗаканчивающиесяДокументы
	|ИЗ
	|	Документ.упДокументТранспортногоСредстваВодителя КАК упДокументТранспортногоСредстваВодителя
	|ГДЕ
	|	ЕСТЬNULL(упДокументТранспортногоСредстваВодителя.ТипДокумента.ПредупреждатьОбОкончанииСрокаДействия, ЛОЖЬ)
	|	И упДокументТранспортногоСредстваВодителя.ДействуетПо <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, упДокументТранспортногоСредстваВодителя.ТипДокумента.ИнтервалПредупреждения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаканчивающиесяДокументы.Ссылка
	|ИЗ
	|	втЗаканчивающиесяДокументы КАК втЗаканчивающиесяДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упДокументТранспортногоСредстваВодителя КАК упДокументТранспортногоСредстваВодителя
	|		ПО втЗаканчивающиесяДокументы.Ссылка = упДокументТранспортногоСредстваВодителя.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.упПродлениеДокументаТСВодителя КАК упПродлениеДокументаТСВодителя
	|		ПО втЗаканчивающиесяДокументы.Ссылка = упПродлениеДокументаТСВодителя.Предмет
	|ГДЕ
	|	упДокументТранспортногоСредстваВодителя.Ссылка ЕСТЬ NULL
	|	И упПродлениеДокументаТСВодителя.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НовыйПроцесс = БизнесПроцессы.упПродлениеДокументаТСВодителя.СоздатьБизнесПроцесс();
		НовыйПроцесс.Заполнить(Выборка.Ссылка);
		НовыйПроцесс.Записать();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
